Dony-kylin/STM32H743/Expand/Src/ad7606_scope.c
#include "ad7606_scope.h"

#include "stm32h7xx_hal.h"

#include <string.h>

/*
 * The acquisition task submits blocks captured from the AD9220.
 * A 4096-sample ring gives the measurement code enough history to calculate
 * stable time-domain values without slowing the converter down.
 */
#define SCOPE_RING_SIZE               4096U
#define SCOPE_RING_MASK               (SCOPE_RING_SIZE - 1U)
#define SCOPE_DEFAULT_MV_PER_DIV      100U
#define SCOPE_DEFAULT_REFRESH_MS      500U

#define SCOPE_D2_RAM                  __attribute__((section(".scope_ram"), aligned(32)))

static int16_t scope_ring_samples[SCOPE_RING_SIZE] SCOPE_D2_RAM;
static uint32_t scope_ring_cycles[SCOPE_RING_SIZE] SCOPE_D2_RAM;

static volatile uint32_t scope_write_count;
static uint32_t scope_decimation_count;
static uint32_t scope_full_scale_mv = 5000U;
static volatile uint32_t scope_channel_index;
static volatile uint32_t scope_mv_per_div;
static volatile uint32_t scope_decimation;
static volatile int32_t scope_center_mv;
static volatile uint32_t scope_time_per_div_us;
static volatile uint32_t scope_refresh_ms;
static volatile uint32_t scope_input_sample_rate_hz;
static volatile uint8_t scope_running;
static volatile uint8_t scope_center_auto;
static uint64_t scope_virtual_cycles_q32;
static AD7606_ScopeMeasurements scope_measurements;

static void ScopeAnalyzeMeasurements(const int16_t *samples, uint32_t count,
                                     uint32_t input_sample_rate_hz);
static uint32_t ScopeIntegerSqrt(uint64_t value);
static int32_t ScopeRawToMv(int32_t raw);

void AD7606_ScopeInit(uint32_t full_scale_mv)
{
  scope_full_scale_mv = (full_scale_mv != 0U) ? full_scale_mv : 2500U;
  scope_write_count = 0U;
  scope_decimation_count = 0U;
  scope_channel_index = 0U;
  scope_mv_per_div = SCOPE_DEFAULT_MV_PER_DIV;
  scope_decimation = AD7606_SCOPE_DECIMATION;
  scope_center_mv = 0;
  scope_time_per_div_us = 0U;
  scope_refresh_ms = SCOPE_DEFAULT_REFRESH_MS;
  scope_input_sample_rate_hz = 0U;
  scope_running = 1U;
  scope_center_auto = 1U;
  scope_virtual_cycles_q32 = 0U;
  memset(&scope_measurements, 0, sizeof(scope_measurements));

  /* CYCCNT provides sub-microsecond timestamps without consuming a timer. */
  CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
  DWT->CYCCNT = 0U;
  DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
}

void AD7606_ScopePushFrame(const int16_t *channels)
{
  uint32_t decimation;
  uint32_t channel;
  uint32_t write_count;
  uint32_t index;

  if ((channels == NULL) || (scope_running == 0U))
  {
    return;
  }

  ++scope_decimation_count;
  decimation = scope_decimation;
  if (scope_decimation_count < decimation)
  {
    return;
  }
  scope_decimation_count = 0U;

  channel = scope_channel_index;
  write_count = scope_write_count;
  index = write_count & SCOPE_RING_MASK;

  scope_ring_samples[index] = channels[channel];
  scope_ring_cycles[index] = DWT->CYCCNT;
  __DMB();
  scope_write_count = write_count + 1U;
}

void AD7606_ScopePushSamples(const int16_t *samples, uint32_t count,
                             uint32_t input_sample_rate_hz)
{
  uint64_t cycles_per_sample_q32;
  uint32_t decimation;
  uint32_t decimation_count;
  uint32_t write_count;

  if ((samples == NULL) || (count == 0U) ||
      (input_sample_rate_hz == 0U) || (scope_running == 0U))
  {
    return;
  }

  cycles_per_sample_q32 =
      ((uint64_t)SystemCoreClock << 32U) / input_sample_rate_hz;
  decimation = scope_decimation;
  decimation_count = scope_decimation_count;
  write_count = scope_write_count;

  for (uint32_t i = 0U; i < count; ++i)
  {
    scope_virtual_cycles_q32 += cycles_per_sample_q32;
    ++decimation_count;
    if (decimation_count >= decimation)
    {
      uint32_t index = write_count & SCOPE_RING_MASK;

      decimation_count = 0U;
      scope_ring_samples[index] = samples[i];
      scope_ring_cycles[index] =
          (uint32_t)(scope_virtual_cycles_q32 >> 32U);
      __DMB();
      ++write_count;
      scope_write_count = write_count;
    }
  }

  scope_decimation_count = decimation_count;
  scope_input_sample_rate_hz = input_sample_rate_hz;
  ScopeAnalyzeMeasurements(samples, count, input_sample_rate_hz);
}

void AD7606_ScopeGetConfig(AD7606_ScopeConfig *config)
{
  if (config == NULL)
  {
    return;
  }

  config->channel = (uint8_t)(scope_channel_index + 1U);
  config->running = scope_running;
  config->center_auto = scope_center_auto;
  config->reserved = 0U;
  config->mv_per_div = (uint16_t)scope_mv_per_div;
  config->decimation = (uint16_t)scope_decimation;
  config->center_mv = scope_center_mv;
  config->time_per_div_us = scope_time_per_div_us;
  config->refresh_ms = scope_refresh_ms;
}

uint8_t AD7606_ScopeSetChannel(uint32_t channel)
{
  if (channel != 1U)
  {
    return 0U;
  }

  scope_channel_index = channel - 1U;
  scope_write_count = 0U;
  scope_decimation_count = 0U;
  return 1U;
}

uint8_t AD7606_ScopeSetMvPerDiv(uint32_t mv_per_div)
{
  if ((mv_per_div != 50U) && (mv_per_div != 100U) &&
      (mv_per_div != 200U) && (mv_per_div != 500U) &&
      (mv_per_div != 1000U) && (mv_per_div != 2000U))
  {
    return 0U;
  }

  scope_mv_per_div = mv_per_div;
  return 1U;
}

uint8_t AD7606_ScopeSetDecimation(uint32_t decimation)
{
  if ((decimation != 1U) && (decimation != 2U) &&
      (decimation != 4U) && (decimation != 8U) &&
      (decimation != 16U) && (decimation != 32U))
  {
    return 0U;
  }

  scope_decimation = decimation;
  scope_write_count = 0U;
  scope_decimation_count = 0U;
  return 1U;
}

uint8_t AD7606_ScopeSetCenterMv(int32_t center_mv)
{
  if ((center_mv < -(int32_t)scope_full_scale_mv) ||
      (center_mv > (int32_t)scope_full_scale_mv))
  {
    return 0U;
  }

  scope_center_mv = center_mv;
  scope_center_auto = 0U;
  return 1U;
}

void AD7606_ScopeSetCenterAuto(uint8_t automatic)
{
  scope_center_auto = (automatic != 0U) ? 1U : 0U;
}

uint8_t AD7606_ScopeSetTimePerDivUs(uint32_t time_per_div_us)
{
  if ((time_per_div_us != 0U) &&
      ((time_per_div_us < 10U) || (time_per_div_us > 1000000U)))
  {
    return 0U;
  }

  scope_time_per_div_us = time_per_div_us;
  return 1U;
}

