Dony-kylin/STM32H743/Expand/Src/ad7606_scope.c
  for (uint32_t bin = minimum_bin; bin <= maximum_bin; ++bin)
  {
    float real = scope_fft_buffer[2U * bin];
    float imaginary = scope_fft_buffer[(2U * bin) + 1U];
    float power = (real * real) + (imaginary * imaginary);

    if (power > peak_power)
    {
      peak_power = power;
      peak_bin = bin;
    }
  }

  if ((peak_bin <= minimum_bin) || (peak_bin >= maximum_bin) ||
      (peak_power <= 0.0f))
  {
    return (peak_bin != 0U) ?
        (uint32_t)(((uint64_t)peak_bin * input_sample_rate_hz *
                    1000U) / SCOPE_FFT_SIZE) : 0U;
  }

  /*
   * Log-power parabolic interpolation reduces the remaining fractional-bin
   * error without changing the 122 Hz fundamental FFT resolution.
   */
  {
    float left_real = scope_fft_buffer[2U * (peak_bin - 1U)];
    float left_imaginary =
        scope_fft_buffer[(2U * (peak_bin - 1U)) + 1U];
    float right_real = scope_fft_buffer[2U * (peak_bin + 1U)];
    float right_imaginary =
        scope_fft_buffer[(2U * (peak_bin + 1U)) + 1U];
    float left_power =
        (left_real * left_real) + (left_imaginary * left_imaginary);
    float right_power =
        (right_real * right_real) + (right_imaginary * right_imaginary);
    float delta = 0.0f;

    if ((left_power > 0.0f) && (right_power > 0.0f))
    {
      float left_log = logf(left_power);
      float center_log = logf(peak_power);
      float right_log = logf(right_power);
      float denominator =
          left_log - (2.0f * center_log) + right_log;

      if (fabsf(denominator) > 1.0e-12f)
      {
        delta = 0.5f * (left_log - right_log) / denominator;
        if (delta > 0.5f)
        {
          delta = 0.5f;
        }
        else if (delta < -0.5f)
        {
          delta = -0.5f;
        }
      }
    }

    {
      float frequency_hz =
          ((float)peak_bin + delta) *
          ((float)input_sample_rate_hz / (float)SCOPE_FFT_SIZE);
      return (uint32_t)((frequency_hz * 1000.0f) + 0.5f);
    }
  }
}
#endif

#if 0
/* Legacy LCD renderer retained only as historical reference. */
static void ScopeAnalyzeAndRender(uint32_t count,
                                  const AD7606_ScopeConfig *config)
{
  int16_t minimum = scope_snapshot_samples[0];
  int16_t maximum = scope_snapshot_samples[0];
  int64_t sum = 0;
  uint64_t sum_squares = 0U;
  int32_t mean;
  int32_t display_center_mv;
  uint64_t variance;
  uint32_t rms_raw;
  uint32_t display_sample_rate_hz = 0U;
  uint32_t input_sample_rate_hz = 0U;
  uint32_t frequency_millihz = 0U;
  uint32_t crossings[16];
  uint32_t crossing_count = 0U;
  uint32_t period_samples = 0U;
  uint32_t plot_span = SCOPE_GRAPH_WIDTH - 1U;
  uint32_t plot_start = count - SCOPE_GRAPH_WIDTH;
  int32_t hysteresis;
  uint8_t trigger_armed = 0U;
  char line[64];

  for (uint32_t i = 0U; i < count; ++i)
  {
    int32_t value = scope_snapshot_samples[i];
    if (value < minimum)
    {
      minimum = (int16_t)value;
    }
    if (value > maximum)
    {
      maximum = (int16_t)value;
    }
    sum += value;
    sum_squares += (uint64_t)((int64_t)value * value);
  }

  mean = (int32_t)(sum / (int64_t)count);
  display_center_mv = (config->center_auto != 0U) ?
                      ScopeRawToMv(mean) : config->center_mv;
  {
    int64_t mean_square = (int64_t)(sum_squares / count);
    int64_t dc_square = (int64_t)mean * mean;
    variance = (mean_square > dc_square) ?
               (uint64_t)(mean_square - dc_square) : 0U;
  }
  rms_raw = ScopeIntegerSqrt(variance);

  {
    uint32_t elapsed_cycles =
        scope_snapshot_cycles[count - 1U] - scope_snapshot_cycles[0];
    if (elapsed_cycles != 0U)
    {
      display_sample_rate_hz = (uint32_t)
          (((uint64_t)(count - 1U) * SystemCoreClock) / elapsed_cycles);
    }
  }
  input_sample_rate_hz = display_sample_rate_hz * config->decimation;
  scope_input_sample_rate_hz = input_sample_rate_hz;

  /*
   * A Schmitt-style trigger rejects small zero-crossing noise. The trigger
   * follows the measured DC mean independently of the selected display
   * center voltage.
   */
  hysteresis = ((int32_t)maximum - (int32_t)minimum) / 20;
  if (hysteresis < 8)
  {
    hysteresis = 8;
  }

  for (uint32_t i = 0U; i < count; ++i)
  {
    int32_t value = scope_snapshot_samples[i];
    if (value <= (mean - hysteresis))
    {
      trigger_armed = 1U;
    }
    else if ((trigger_armed != 0U) && (value >= (mean + hysteresis)))
    {
      if (crossing_count < (sizeof(crossings) / sizeof(crossings[0])))
      {
        crossings[crossing_count++] = i;
      }
      else
      {
        memmove(&crossings[0], &crossings[1],
                (sizeof(crossings) / sizeof(crossings[0]) - 1U) *
                sizeof(crossings[0]));
        crossings[(sizeof(crossings) / sizeof(crossings[0])) - 1U] = i;
      }
      trigger_armed = 0U;
    }
  }

  if (crossing_count >= 2U)
  {
    uint32_t first_period = (crossing_count > 6U) ?
                            (crossing_count - 6U) : 1U;
    uint32_t periods = crossing_count - first_period;
    uint32_t total_samples =
        crossings[crossing_count - 1U] - crossings[first_period - 1U];
    uint32_t total_cycles =
        scope_snapshot_cycles[crossings[crossing_count - 1U]] -
        scope_snapshot_cycles[crossings[first_period - 1U]];

    if ((periods != 0U) && (total_samples != 0U))
    {
      period_samples = total_samples / periods;
    }
    if ((periods != 0U) && (total_cycles != 0U))
    {
      uint32_t average_period_cycles = total_cycles / periods;
      if (average_period_cycles != 0U)
      {
        frequency_millihz = (uint32_t)
            (((uint64_t)SystemCoreClock * 1000U) / average_period_cycles);
      }
    }
  }

  {
    int32_t newest_mv =
        ScopeRawToMv(scope_snapshot_samples[count - 1U]);
    int32_t dc_mv = ScopeRawToMv(mean);
    uint32_t peak_to_peak_mv = (uint32_t)ScopeRawToMv(
        (int32_t)maximum - (int32_t)minimum);
    uint32_t amplitude_mv = (peak_to_peak_mv + 1U) / 2U;
    uint32_t rms_mv = (uint32_t)ScopeRawToMv((int32_t)rms_raw);

    scope_measurements.voltage_mv = newest_mv;
    scope_measurements.dc_mv = dc_mv;
    scope_measurements.amplitude_mv = amplitude_mv;
    scope_measurements.peak_to_peak_mv = peak_to_peak_mv;
    scope_measurements.rms_mv = rms_mv;
    scope_measurements.frequency_millihz = frequency_millihz;
    scope_measurements.sample_rate_hz = input_sample_rate_hz;
    scope_measurements.valid = 1U;
  }

  {
    uint64_t desired_span = 0U;

    if ((config->time_per_div_us != 0U) &&
        (display_sample_rate_hz != 0U))
    {
      desired_span = ((uint64_t)display_sample_rate_hz *
                      config->time_per_div_us *
                      SCOPE_HORIZONTAL_DIVS) / 1000000U;
      if (desired_span == 0U)
      {
        desired_span = 1U;
      }
    }
    else if (period_samples != 0U)
    {
      desired_span = (uint64_t)period_samples * 2U;
    }

    if (desired_span != 0U)
    {
      if (desired_span > (count - 1U))
      {
        desired_span = count - 1U;
      }
      if (desired_span == 0U)
      {
        desired_span = 1U;
      }
      plot_span = (uint32_t)desired_span;
    }
  }

  {
    uint32_t required_pre = plot_span / 8U;
    uint32_t required_post = plot_span - required_pre;

